{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, registrant CRUD, search, and user badge creation using AccessControl and Map structures.",
  "feature_evidence.json": "Feature evidence report mapping features to files, components, and test IDs for deployment verification and diagnostics.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles in routing, components, hooks, styling, deployment utilities, and 3D world features.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment guide explaining build, deployment, verification, diagnostics, URL correctness, and troubleshooting for canister IDs.",
  "frontend/index.css": "Tailwind base layer defining warm OKLCH-themed CSS variables for light and dark modes and applying global background/text styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and layout components including profile modal.",
  "frontend/src/components/AppLayout.tsx": "Layout with navigation, authentication, user badge display, deployment mismatch banner, and footer, wrapping routed content.",
  "frontend/src/components/AuthControls.tsx": "Provides a sign‑in/sign‑out button using Internet Identity and handles login edge cases and query cache clearing.",
  "frontend/src/components/DeploymentInfo.tsx": "Shows deployment diagnostics in a popover, including canister mismatch alerts and copyable deployment fields.",
  "frontend/src/components/OisyWalletNavItem.tsx": "Renders a wallet navigation item that adapts to authentication and configuration state and opens the Oisy wallet URL when available.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal prompting authenticated users without profiles to enter a display name and saves it via a mutation.",
  "frontend/src/components/world/PlanetWorldScene.tsx": "Renders a rotating 3D planet scene with animated inhabitants using React Three Fiber and dynamically marks new additions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, reinitializing on identity change and invalidating dependent queries.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides user state by fetching profile, role, and admin status via the actor and indicates authentication via Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider, managing AuthClient creation, login state, stored identities, and logout.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on user profiles and registrants via the backend actor, including search, count, and invalidation logic.",
  "frontend/src/hooks/useUserBadge.ts": "Defines a query hook to fetch or create the user's badge using the actor and Internet Identity state.",
  "frontend/src/index.css": "Configures Tailwind CSS layers and defines light/dark mode CSS variables for the app’s color system.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/DirectoryPage.tsx": "Implements a directory view with search, filtering, admin deletion, and UI states for loading and errors.",
  "frontend/src/pages/EventsPage.tsx": "Displays a static events page outlining completed and upcoming steps in the Web3 onboarding flow.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with hero content, features, and navigation to registration or directory pages.",
  "frontend/src/pages/RegistrationPage.tsx": "Implements the user registration form with validation, badge fetching, existing data loading, and registrant submission.",
  "frontend/src/pages/WorldPage.tsx": "Page showing a 3D planet visualization tied to registrant count, with authentication gating and real‑time loading/error states.",
  "frontend/src/utils/deploymentInfo.ts": "Utility for inferring deployment network and canister IDs from env vars and hostname, with mismatch detection and diagnostics.",
  "frontend/src/utils/oisyWallet.ts": "Reads and validates the OISY wallet URL from environment variables and exposes a simple config check.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using both query strings and hash routing.",
  "frontend/src/utils/worldPlacement.ts": "Generates deterministic 3D positions and colors for inhabitants on a sphere using golden‑angle distribution.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings with plugins.",
  "project_state.json": "Project metadata summarizing goals, architecture notes, known issues, and existing feature tracking."
}