{
  "backend/main.mo": "Motoko canister implementing registrant, profile, and badge storage with authorization checks for queries and updates.",
  "feature_evidence.json": "Feature-evidence report mapping features to source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of all major frontend files.",
  "frontend/DEPLOYMENT.md": "Guide outlining mainnet deployment steps, canister ID verification, mismatch handling, and recommended environment variables.",
  "frontend/index.css": "Tailwind base and theme variables defining warm color palette and dark mode overrides.",
  "frontend/index.html": "Root HTML file mounting the React app and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with layout, profile modal, and theme provider.",
  "frontend/src/components/AppLayout.tsx": "Global layout with navigation, user badge, auth controls, mobile menu, and deployment mismatch warnings.",
  "frontend/src/components/AuthControls.tsx": "Provides a sign-in/sign-out button using Internet Identity, handling login state, errors, and cache clearing.",
  "frontend/src/components/DeploymentInfo.tsx": "Shows deployment configuration details in a popover with copyable fields, mismatch alerts, and diagnostics.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal prompting new authenticated users to submit a display name and saves it via mutation.",
  "frontend/src/components/world/PlanetWorldScene.tsx": "Renders a rotating planet with animated inhabitants using react-three-fiber, updating positions and new entity animations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Retrieves the authenticated user's profile, role, and admin status using actor-backed queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines mutations and queries for user profiles and registrants, automatically invalidating caches on updates.",
  "frontend/src/hooks/useUserBadge.ts": "Fetches or creates the current user's badge using the authenticated backend actor with caching.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/DirectoryPage.tsx": "Provides a searchable, filterable directory of registrants with admin deletion support and loading/error states.",
  "frontend/src/pages/EventsPage.tsx": "Displays a coming-soon events page with completed step info and previews of upcoming community features.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with hero content, calls to action, and feature highlights.",
  "frontend/src/pages/RegistrationPage.tsx": "Implements user registration and profile editing with validation, interest selection, and badge loading.",
  "frontend/src/pages/WorldPage.tsx": "Shows a digital world visualization tied to registrant count with authentication gates and community stats.",
  "frontend/src/utils/deploymentInfo.ts": "Reads deployment env vars and infers network and canister IDs from the hostname, including mismatch detection for IC mainnet.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/worldPlacement.ts": "Generates deterministic 3D positions and colors for inhabitants using golden‑angle distribution and seeded math.",
  "frontend/tailwind.config.js": "Tailwind configuration extending typography, color tokens, container settings, animations, and plugin support.",
  "project_state.json": "Project status file describing app goals, architecture notes, known issues, and implemented features metadata."
}