{
  "backend/main.mo": "Main backend actor implementing user profiles, registrants, badges, and authorization-checked CRUD/query operations.",
  "backend/migration.mo": "Migration module adding a new userBadges map while preserving existing registrants and user profiles.",
  "feature_evidence.json": "Defines feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all major frontend files and hooks.",
  "frontend/index.css": "Global Tailwind-based theme definitions with warm OKLCH color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with AppLayout, ProfileSetupModal, and ThemeProvider.",
  "frontend/src/components/AppLayout.tsx": "Main layout with navigation, authentication UI, and user badge display handling both desktop and mobile.",
  "frontend/src/components/AuthControls.tsx": "Internet Identity sign‑in/out button with loading state and query cache clearing.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new authenticated users to provide a display name before using the app.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the caller’s user profile, role, and admin status using the actor and exposes combined authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, stored identity loading, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Contains CRUD query and mutation hooks for user profiles and registrants using the backend actor with react-query caching.",
  "frontend/src/hooks/useUserBadge.ts": "Fetches or creates the current user’s badge via the backend actor with simple retry and caching rules.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global styling rules.",
  "frontend/src/main.tsx": "Application entry point initializing React, react-query, Internet Identity provider, and global styles.",
  "frontend/src/pages/DirectoryPage.tsx": "Displays a searchable, filterable registrant directory with admin-only deletion and various loading and error states.",
  "frontend/src/pages/EventsPage.tsx": "Static events page outlining completed and upcoming steps with informational UI components.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero content, feature highlights, and buttons that adapt based on authentication state.",
  "frontend/src/pages/RegistrationPage.tsx": "Registration form that loads existing user data, validates inputs, and submits registrant info to the backend.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using search, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Project metadata describing current features, requirements, and state of the ICP/Web3 onboarding app."
}