{
  "backend/main.mo": "Actor implementation handling registrants, user profiles, badges, and access control with authorization checks and search/filter utilities.",
  "backend/migration.mo": "Migration module converting old registrant records to new format by adding optional social and crypto fields.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and component versions.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing steps, verification, environment handling, and troubleshooting for mainnet releases.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining warm color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and global layout with theming and profile setup modal.",
  "frontend/src/components/AppLayout.tsx": "Main app layout with header, navigation, mobile menu handling, auth controls, and deployment mismatch warnings.",
  "frontend/src/components/AuthControls.tsx": "Provides sign-in/sign-out button logic using Internet Identity with loading and error handling.",
  "frontend/src/components/DeploymentInfo.tsx": "Popover component showing deployment diagnostics, canister mismatch alerts, and copyable deployment data.",
  "frontend/src/components/OisyWalletNavItem.tsx": "Empty placeholder component file.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save a display name.",
  "frontend/src/components/world/PlanetWorldScene.tsx": "Three.js scene rendering a rotating planet and animated inhabitants with auto-rotating camera controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches current user's profile, role, and admin status using the actor and Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on user profiles and registrants via the actor API, including list, search, add, delete, and count functions.",
  "frontend/src/hooks/useUserBadge.ts": "Defines a React Query hook to fetch or create the current user's badge using the actor API with caching and minimal retries.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines light/dark theme CSS variables for colors, layout, and UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/DirectoryPage.tsx": "Implements a searchable and filterable community directory with skill filters, admin deletion, and loading/error states.",
  "frontend/src/pages/EventsPage.tsx": "Displays a teaser page for upcoming Web3-related features with informational cards and a completed-step indicator.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero content, calls to action, and feature highlights for joining the network.",
  "frontend/src/pages/RegistrationPage.tsx": "Provides a registration form allowing authenticated users to create or update a registrant profile with validation and badge loading.",
  "frontend/src/pages/WorldPage.tsx": "Renders the Digital World scene with authentication gating, registrant count fetching, error handling, and a 3D planet visualization.",
  "frontend/src/utils/deploymentInfo.ts": "Provides deployment environment detection, infers network/canister IDs from hostname, and reports mismatches for diagnostics.",
  "frontend/src/utils/oisyWallet.ts": "Empty placeholder file for Oisy wallet utilities.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL parameters and session-stored values.",
  "frontend/src/utils/worldPlacement.ts": "Generates deterministic 3D positions and colors for inhabitants on a sphere using golden-angle distribution.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, typography, animations, and plugins.",
  "project_state.json": "Metadata file describing project state, requirements, architecture notes, and known issues."
}