{
  "backend/main.mo": "Actor implementing registrant, profile, and badge management with access control, including CRUD operations and search with permission checks.",
  "feature_evidence.json": "Feature evidence report mapping wallet navigation and configuration features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, hooks, pages, and utilities.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing steps for deploying to the Internet Computer, verifying canister IDs, and configuring optional environment variables.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color tokens and theme variables for light and dark modes using OKLCH values.",
  "frontend/index.html": "Basic HTML entry file loading the frontend root element and main TypeScript bundle.",
  "frontend/src/App.tsx": "Root application setup configuring TanStack Router routes and wrapping the app with theming and layout components.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing navigation, wallet link, user badge display, global mismatch warnings, and responsive mobile menu.",
  "frontend/src/components/AuthControls.tsx": "Authentication control component handling Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/DeploymentInfo.tsx": "Popover UI that displays deployment diagnostics, canister mismatch warnings, and copyable deployment values.",
  "frontend/src/components/OisyWalletNavItem.tsx": "Navigation item that conditionally links to the Oisy Wallet based on authentication and configuration state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save a display name.",
  "frontend/src/components/world/PlanetWorldScene.tsx": "Three.js scene rendering a rotating planet with animated inhabitants positioned via utility functions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching the caller’s profile, role, and admin status, combining them into a current user state object.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for saving user profiles, managing registrants, and fetching counts via the actor API.",
  "frontend/src/hooks/useUserBadge.ts": "Provides a query hook that retrieves or creates the current user's badge using the actor API.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines CSS variables for light and dark theme color palettes.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/DirectoryPage.tsx": "Displays a searchable and filterable list of registrants with admin delete support.",
  "frontend/src/pages/EventsPage.tsx": "Shows a coming‑soon events page outlining completed and upcoming Web3 steps.",
  "frontend/src/pages/LandingPage.tsx": "Renders the main landing page with onboarding messaging, hero section, and navigation actions.",
  "frontend/src/pages/RegistrationPage.tsx": "Implements the user registration form, loading existing data, validating fields, and saving registrants.",
  "frontend/src/pages/WorldPage.tsx": "Renders the Digital World page, showing a 3D planet with inhabitant count and handling auth, loading, and error states.",
  "frontend/src/utils/deploymentInfo.ts": "Provides deployment info by combining env vars with runtime inference and detects canister/network mismatches.",
  "frontend/src/utils/oisyWallet.ts": "Fetches the OISY wallet URL from env vars and exposes a check for whether it is configured.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/src/utils/worldPlacement.ts": "Generates deterministic 3D positions and colors for inhabitants on a sphere using golden-angle distribution.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings with plugins.",
  "project_state.json": "Contains metadata about project goals, features, issues, and current build/deployment state."
}