{
  "kind": "build_request",
  "title": "Add in-app access flow to the OISY wallet",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Add a user-facing entry point in the app header navigation (desktop + mobile menu) that lets authenticated users open their OISY wallet from within the app via an external link (new tab) with safe target/rel attributes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "je veux que mes utilisateurs puissent accèder à leur wallet OISY via mon app"
        ]
      },
      "acceptanceCriteria": [
        "When the user is authenticated, a \"Wallet\" (or \"OISY Wallet\") navigation item is visible in the header navigation and in the mobile menu.",
        "Clicking the navigation item opens the OISY wallet in a new browser tab/window using target=\"_blank\" and rel=\"noopener noreferrer\".",
        "When the user is not authenticated, the wallet navigation item is either hidden or replaced with a disabled/locked state that clearly prompts the user to sign in first (English UI text).",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT (compose existing UI components instead)."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Provide a configurable OISY wallet URL that the frontend uses for the wallet navigation link, and show a clear, non-blocking UI message if the URL is not configured.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6"
        ],
        "quotes": [
          "je veux que mes utilisateurs puissent accèder à leur wallet OISY via mon app"
        ]
      },
      "acceptanceCriteria": [
        "The wallet link URL is configurable via a single frontend configuration point (e.g., an environment variable) without requiring backend changes.",
        "If the wallet URL is missing/empty, the UI does not crash; the wallet action is disabled and a concise English message explains that the wallet link is not configured.",
        "Default app flows (registration, directory browsing, world page) continue to work unchanged when the wallet URL is not configured."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (no additional backend services).",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui; compose them instead.",
    "Do not add unsupported wallet integrations (e.g., MetaMask/WalletConnect)."
  ],
  "nonGoals": [
    "Embedding the OISY wallet inside an iframe with transaction signing inside this app.",
    "Implementing new backend APIs for wallet balances/transactions.",
    "Adding any third-party authentication system beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}