{
  "kind": "build_request",
  "title": "Update Game page: allow removing only one brick, reveal congratulatory text, remove clue section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-48",
      "text": "Update the Game page so a user can remove only one brick total per page load/session. After one brick has been removed, all remaining intact bricks must be disabled (no further confirmation dialog, no additional removals).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "l'utilisateur ne peut retirer qu'une seule brique"
        ]
      },
      "acceptanceCriteria": [
        "On /game, the first intact brick click still opens the existing confirmation dialog flow and allows removing that single brick.",
        "After one brick is removed, clicking any other intact brick does nothing (no dialog opens) and no additional bricks can be removed.",
        "The removed brick remains removed; other bricks remain visually intact/unclickable for removal."
      ]
    },
    {
      "id": "REQ-49",
      "text": "After the user removes their single allowed brick, display the following exact text behind the brick wall: \"Congrats ! You just got your first REAL WORLD ASSET\". The text must be visible in the brick-wall area behind/under the grid (i.e., revealed by removal).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "derr!ère les briques le texte qui apparait est : \"Congrats ! You just got your first REAL WORLD ASSET\""
        ]
      },
      "acceptanceCriteria": [
        "Before any brick is removed, the congratulatory text is not visible.",
        "After a brick is removed, the congratulatory text becomes visible behind the grid (in the brick wall card area).",
        "The displayed string matches exactly: Congrats ! You just got your first REAL WORLD ASSET"
      ]
    },
    {
      "id": "REQ-50",
      "text": "Remove the clue/hint section at the bottom of the Game page (including the clue image card and its accompanying hint text), and ensure there is no remaining clue-related UI on /game.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "enlève l'indice en bas de page"
        ]
      },
      "acceptanceCriteria": [
        "The \"Clue Image\" card is no longer rendered on the Game page.",
        "The bottom hint text (e.g., instructions to keep removing bricks) is no longer present.",
        "No other clue/hint UI remains on the Game page."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep changes scoped to the existing Game page implementation (frontend/src/pages/GamePage.tsx)."
  ],
  "nonGoals": [
    "Do not add backend APIs or persistence for the game state.",
    "Do not change global navigation or routes.",
    "Do not generate or modify static image assets for this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}