{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove wallet navigation and add social/crypto fields to registrant profile UI",
  "requirements": [
    {
      "id": "REQ-34",
      "summary": "Remove all Wallet/OISY Wallet navigation entry points from desktop header nav and mobile menu, including any wallet-related tooltip/disabled messaging in navigation.",
      "acceptanceCriteria": [
        "The header navigation no longer renders the wallet navigation item on desktop.",
        "The mobile menu no longer renders the wallet navigation item.",
        "No wallet-related tooltip/disabled state messaging is shown anywhere in the navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Remove import and rendering of the wallet navigation item from both the desktop nav and the mobile menu so no wallet UI text/tooltips appear in navigation."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Remove unused OISY wallet configuration usage from the frontend so the app no longer references VITE_OISY_WALLET_URL or attempts to open an OISY wallet URL.",
      "acceptanceCriteria": [
        "The frontend builds without referencing OISY wallet URL configuration for navigation.",
        "No runtime code paths attempt to open an OISY wallet URL."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OisyWalletNavItem.tsx",
          "operation": "delete",
          "description": "Delete the wallet navigation component to eliminate all remaining UI and runtime behavior that reads wallet configuration or opens the wallet URL."
        },
        {
          "path": "frontend/src/utils/oisyWallet.ts",
          "operation": "delete",
          "description": "Delete the OISY wallet URL helper to remove all runtime references to VITE_OISY_WALLET_URL from the codebase."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Ensure any leftover imports/usages of OisyWalletNavItem (and any related wallet config helpers) are removed so the bundle no longer includes wallet configuration code."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Extend the registration/profile form UI with optional inputs for Facebook, Instagram, Telegram, Website, and Crypto address; save and pre-fill these fields from the registrant record.",
      "acceptanceCriteria": [
        "The registration page includes new optional inputs labeled in English: “Facebook”, “Instagram”, “Telegram”, “Website”, and “Crypto address”.",
        "Submitting the form saves these values to the backend along with existing registrant fields.",
        "When revisiting the registration page, previously saved values for these fields are pre-filled from the existing registrant record.",
        "Leaving these fields empty does not block submission."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/RegistrationPage.tsx",
          "operation": "modify",
          "description": "Add optional form state and inputs for facebook/instagram/telegram/website/cryptoAddress (English labels), prefill them from the existing registrant data when available, and include them in the registrant payload when saving without adding required validation."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Update directory cards to conditionally display a registrant’s social links (Facebook, Instagram, Telegram, Website) and crypto address only when provided.",
      "acceptanceCriteria": [
        "Directory cards conditionally render each social link field only if it exists for that registrant.",
        "Directory cards conditionally render the crypto address only if it exists for that registrant.",
        "The directory page remains usable and visually consistent when none of the optional fields are present for a registrant."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DirectoryPage.tsx",
          "operation": "modify",
          "description": "Extend the registrant card UI to render Facebook/Instagram/Telegram/Website/Crypto address sections only when the corresponding optional fields exist on the registrant record, keeping layout consistent when absent."
        }
      ]
    }
  ]
}