{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "User badge display, external website link, and Events/Coming Soon page",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Fetch and display the authenticated user’s issued unique ID and badge (including first-login issuance) without blocking existing registration/profile flows.",
      "acceptanceCriteria": [
        "After a successful Internet Identity sign-in, the app requests the caller’s issued ID+badge from the backend and shows it in an appropriate place (e.g., header/account area and/or registration/profile area).",
        "If the backend has not issued an ID+badge yet for that user, the first authenticated load triggers issuance and the UI updates to show the new ID+badge without requiring a page refresh.",
        "If the ID+badge fetch fails, the rest of the app remains usable (no hard crash); the UI shows a non-blocking error or fallback state.",
        "User-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useUserBadge.ts",
          "operation": "create",
          "description": "Create React Query hook(s) to call the backend capability getOrCreateUserBadge() when the user is authenticated, returning loading/error/data states and avoiding hard failures; leverage existing Internet Identity state from the app. (Use the authorization component guidance for authenticated UX patterns and graceful trap/error handling; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a small authenticated-only account area in the header (and optionally mobile menu) that displays the issued unique ID and badge using the new useUserBadge hook, with a non-blocking fallback/error state so navigation and other features still work. (Use the authorization component guidance for login-dependent data display and clearing cached data on logout; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/RegistrationPage.tsx",
          "operation": "modify",
          "description": "Display the authenticated user’s issued ID+badge near the top of the registration flow (read-only) using the new useUserBadge hook, ensuring the existing registration form remains usable even if the badge fetch fails. (Use the authorization component guidance for authenticated data fetching patterns; Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add a clearly labeled external link to the Web2 website and brief landing-page copy explaining the project objective (ICP real-world network).",
      "acceptanceCriteria": [
        "The app includes a clearly labeled external link to https://www.dmc-technologies.fr (e.g., in header and/or footer) that opens in a new tab with rel=\"noopener noreferrer\".",
        "The landing page includes brief English copy explaining the objective (creating an ICP real-world network) and references the external website for more details.",
        "No attempt is made to embed or scrape the external website; it is linked as an external URL only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a clearly labeled external link to https://www.dmc-technologies.fr in the header navigation and/or footer, opening in a new tab with rel=\"noopener noreferrer\" (external URL only; no embedding)."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Update landing-page content to include brief English copy stating the objective is creating an ICP real-world network and referencing https://www.dmc-technologies.fr for more details (link only; do not embed/scrape)."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Create an Events/Coming Soon page and add it to navigation with working TanStack Router routing.",
      "acceptanceCriteria": [
        "A new route/page exists (e.g., /events) reachable from the header navigation on desktop and mobile.",
        "The Events/Coming Soon page contains English copy that clearly states: Step 1 is creating an ID; the next step of the Web3/ICP network is coming soon.",
        "The page includes a link to https://www.dmc-technologies.fr for additional information.",
        "Routing works with the existing TanStack Router setup and does not break existing routes (/ , /register, /directory)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/EventsPage.tsx",
          "operation": "create",
          "description": "Create an Events (Coming Soon) page with English copy explaining that Step 1 is creating an ID and the next step of the Web3/ICP network is coming soon, and include an external link to https://www.dmc-technologies.fr (open new tab, rel=\"noopener noreferrer\")."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route for the Events page (e.g., /events) and include it in the route tree alongside existing routes, ensuring existing routes continue to work."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire the Events page into app navigation for both desktop header nav and mobile menu so the /events route is reachable, without disrupting existing links to /, /register, and /directory."
        }
      ]
    }
  ]
}