{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Game page: single brick removal, reveal congratulatory text, remove clue section",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Limit gameplay to a single brick removal per page load/session and disable all remaining intact bricks afterward.",
      "acceptanceCriteria": [
        "On /game, the first intact brick click still opens the existing confirmation dialog flow and allows removing that single brick.",
        "After one brick is removed, clicking any other intact brick does nothing (no dialog opens) and no additional bricks can be removed.",
        "The removed brick remains removed; other bricks remain visually intact/unclickable for removal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Track whether the user has already removed a brick (derive from removedCount or store a boolean set on first removal). Gate handleBrickClick so it only opens the existing confirmation dialog when no brick has been removed yet. After one removal, ensure all intact bricks are disabled (e.g., disabled prop true) and do not trigger any dialog/open state. Keep all changes scoped to this file per constraints."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Reveal the exact congratulatory text behind the brick wall after the single brick removal occurs.",
      "acceptanceCriteria": [
        "Before any brick is removed, the congratulatory text is not visible.",
        "After a brick is removed, the congratulatory text becomes visible behind the grid (in the brick wall card area).",
        "The displayed string matches exactly: Congrats ! You just got your first REAL WORLD ASSET"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Add a behind-the-grid layer within the Brick Wall card area that conditionally renders the exact string \"Congrats ! You just got your first REAL WORLD ASSET\" only when a brick has been removed. Ensure the text is visually located behind/under the grid so it is revealed by the removed brick (without adding new assets or modifying other pages/files)."
        }
      ]
    },
    {
      "id": "REQ-50",
      "summary": "Remove the clue/hint section UI from the bottom/right side of the Game page.",
      "acceptanceCriteria": [
        "The \"Clue Image\" card is no longer rendered on the Game page.",
        "The bottom hint text (e.g., instructions to keep removing bricks) is no longer present.",
        "No other clue/hint UI remains on the Game page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamePage.tsx",
          "operation": "modify",
          "description": "Delete the entire Clue Image card section (including the image and the hint text) from the Game page layout, and adjust the Game Area layout accordingly so no clue/hint UI remains on /game. Keep changes scoped to this file per constraints."
        }
      ]
    }
  ]
}