{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "In-app header entry point for OISY wallet (configurable external link)",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Add a header + mobile-menu navigation entry that lets authenticated users open the OISY wallet in a new tab with safe link attributes, and shows a clear sign-in prompt state otherwise.",
      "acceptanceCriteria": [
        "When the user is authenticated, a \"Wallet\" (or \"OISY Wallet\") navigation item is visible in the header navigation and in the mobile menu.",
        "Clicking the navigation item opens the OISY wallet in a new browser tab/window using target=\"_blank\" and rel=\"noopener noreferrer\".",
        "When the user is not authenticated, the wallet navigation item is either hidden or replaced with a disabled/locked state that clearly prompts the user to sign in first (English UI text).",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT (compose existing UI components instead)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OisyWalletNavItem.tsx",
          "operation": "create",
          "description": "Create a small reusable nav item component that renders (1) an enabled external-link anchor for authenticated users when configured, or (2) a disabled/locked UI state prompting sign-in when unauthenticated. Use the app’s existing authentication state via useCurrentUser (built on the authorization component’s frontend authentication approach). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire the new OISY wallet navigation item into both the desktop header nav and the mobile menu, ensuring the link opens in a new tab with rel=\"noopener noreferrer\" and matches existing header/mobile styling patterns. Compose existing UI components (do not modify files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Add a single frontend configuration point for the OISY wallet URL and disable the wallet action with a non-blocking explanatory message when it is not configured.",
      "acceptanceCriteria": [
        "The wallet link URL is configurable via a single frontend configuration point (e.g., an environment variable) without requiring backend changes.",
        "If the wallet URL is missing/empty, the UI does not crash; the wallet action is disabled and a concise English message explains that the wallet link is not configured.",
        "Default app flows (registration, directory browsing, world page) continue to work unchanged when the wallet URL is not configured."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/oisyWallet.ts",
          "operation": "create",
          "description": "Add a single, centralized frontend configuration utility that reads the OISY wallet URL from a build-time env var (e.g., import.meta.env.VITE_OISY_WALLET_URL), normalizes/validates presence (non-empty), and exposes a safe getter the UI can consume (returning empty/undefined when not configured)."
        },
        {
          "path": "frontend/src/components/OisyWalletNavItem.tsx",
          "operation": "modify",
          "description": "Integrate the OISY wallet config utility so the nav item is disabled when the URL is missing/empty, and render a concise non-blocking English message (e.g., helper text in the menu) explaining the wallet link is not configured. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Document the new frontend env var used to configure the OISY wallet link (e.g., VITE_OISY_WALLET_URL), including a brief note that the Wallet navigation item will be disabled and show a message when unset."
        }
      ]
    }
  ]
}