{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mainnet deployment diagnostics and URL/canister ID mismatch remediation (frontend-only)",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Add a documented, repeatable way to capture and record the deployed frontend/backend canister IDs after an IC deployment.",
      "acceptanceCriteria": [
        "A new `dfx deploy --network ic` completes successfully for both backend and frontend canisters.",
        "The exact deployed canister IDs are recorded from the deploy output (frontend canister ID and backend canister ID)."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Update the deployment guide to include a clearly labeled section/template for recording the *exact* deployed frontend and backend canister IDs copied from `dfx deploy --network ic` output, plus the resulting public URL. Emphasize copying values verbatim from deploy output and storing them for later verification."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Improve mainnet reachability verification guidance and ensure in-app diagnostics normalize/validate the active canister URL (icp0.io) to avoid “Canister ID Not Resolved” confusion.",
      "acceptanceCriteria": [
        "Opening the new deployed frontend public URL `https://[frontend-canister-id].icp0.io/` loads the app successfully in a fresh/incognito browser session.",
        "The previously reported failing URL `https://5cpxd-piaaa-aaaap-qib3q-cai.icp0.io` is either confirmed as no longer the active deployment URL (superseded by the new frontend canister ID) or is remediated so it resolves correctly.",
        "No “Canister ID Not Resolved” gateway error occurs for the correct deployed frontend URL."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Add an explicit verification step for the public canister URL on icp0.io (fresh/incognito) and a troubleshooting note explaining that older URLs (including `https://5cpxd-piaaa-aaaap-qib3q-cai.icp0.io`) may be superseded after a redeploy, and the correct URL must match the newly deployed frontend canister ID."
        },
        {
          "path": "frontend/src/utils/deploymentInfo.ts",
          "operation": "modify",
          "description": "Harden URL/canister inference so the generated/diagnostic public URL is always normalized to `https://<frontend-canister-id>.icp0.io` when on mainnet, even if the app is accessed via `ic0.app` or a raw domain. Also ensure mismatch detection remains based on the canister ID inferred from the *currently accessed* hostname."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Ensure Deployment Info correctly reports mainnet network, the actually-working shareable public URL, and a configured backend canister ID without false mismatch warnings.",
      "acceptanceCriteria": [
        "When the app is opened on mainnet, Deployment Info shows Network = \"Internet Computer (Mainnet)\".",
        "Deployment Info shows a Shareable Public URL that matches the actually-working `https://[frontend-canister-id].icp0.io` URL.",
        "Deployment Info shows a non-empty Backend Canister ID (not \"Not configured\").",
        "No mismatch warning is shown (i.e., no remediation message about differing configured vs accessed frontend canister IDs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/deploymentInfo.ts",
          "operation": "modify",
          "description": "Fix/extend build-time configuration reading to avoid frontend canister ID/config mismatches: read the frontend canister ID from both `VITE_CANISTER_ID` (current) and `VITE_FRONTEND_CANISTER_ID` (documented), preferring the runtime-inferred canister ID on mainnet. Keep backend canister ID sourced from `VITE_BACKEND_CANISTER_ID`, and ensure the returned Network display value remains `ic` when running under IC domains."
        },
        {
          "path": "frontend/src/components/DeploymentInfo.tsx",
          "operation": "modify",
          "description": "Adjust the Deployment Info UI to reflect the updated deploymentInfo logic: ensure the Shareable Public URL shown for mainnet matches the normalized icp0.io URL, and ensure the Backend Canister ID section clearly shows a non-empty configured value when present (and only shows warnings when truly missing). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Align documentation with the actual environment variables supported by the app (include both `VITE_FRONTEND_CANISTER_ID` and `VITE_CANISTER_ID` as acceptable sources if applicable) and instruct how to confirm the backend canister ID is present in the in-app Deployment Info on mainnet."
        }
      ]
    }
  ]
}