{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-08T00:12:43.608Z",
  "summary": "REQ-27 appears implemented via a single frontend config point (VITE_OISY_WALLET_URL) and safe handling when missing. REQ-26 is partially evidenced: the desktop header nav includes the wallet item; mobile-menu inclusion is not clearly shown in the provided truncated diff, though a mobile-capable component was added.",
  "missing_requirements": [
    {
      "id": "REQ-26",
      "requirement": "Show the Wallet/OISY Wallet navigation item in both the header navigation and the mobile menu for authenticated users.",
      "reason": "The diff shows <OisyWalletNavItem /> added to the desktop header <nav className=\"hidden md:flex ...\">, and the new component supports an isMobile mode, but the provided AppLayout.tsx snippet is truncated before any mobile menu content is shown, so mobile-menu wiring cannot be confirmed from the evidence.",
      "evidence": [
        "frontend/src/components/AppLayout.tsx",
        "frontend/src/components/OisyWalletNavItem.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Global canister ID mismatch warning banner with \"Open Correct URL\" behavior in the app layout header.",
      "reason": "Not requested by REQ-26/REQ-27; this introduces additional deployment/mismatch detection UI unrelated to adding an OISY wallet navigation entry point and configurable URL handling.",
      "evidence": [
        "frontend/src/components/AppLayout.tsx"
      ]
    },
    {
      "description": "Expanded deployment documentation focusing on environment inference, mismatch detection/remediation, and Deployment Info as source of truth.",
      "reason": "Not requested by REQ-26/REQ-27; this adds extensive deployment guidance beyond configuring an OISY wallet link URL.",
      "evidence": [
        "frontend/DEPLOYMENT.md"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/DEPLOYMENT.md",
    "frontend/src/components/AppLayout.tsx",
    "frontend/src/components/OisyWalletNavItem.tsx",
    "frontend/src/utils/oisyWallet.ts",
    "project_state.json"
  ]
}